{"meta":{"title":"briankeenan.xyz","subtitle":"HANA Cloud Platform, SAPUI5 and Hana Native Development","description":"HANA Cloud Platform, SAPUI5 and Hana Native Development","author":"Brian Keenan","url":"http://briankeenan.xyz"},"pages":[{"title":"about","date":"2016-09-02T11:27:39.000Z","updated":"2016-09-06T11:20:18.000Z","comments":false,"path":"about/index.html","permalink":"http://briankeenan.xyz/about/index.html","excerpt":"","text":"All about brian Keenan"}],"posts":[{"title":"HANA Cloud Connector","slug":"HANA-Cloud-Connector","date":"2016-09-06T14:16:00.000Z","updated":"2016-09-08T19:08:09.835Z","comments":true,"path":"2016/09/06/HANA-Cloud-Connector/","link":"","permalink":"http://briankeenan.xyz/2016/09/06/HANA-Cloud-Connector/","excerpt":"","text":"In this blog we will configure the HANA cloud connector to deliver data between a HANA native application which exposes data via an OData service. We will then consume this via the HANA Cloud Platform. The first step is to download the HANA Cloud Connector software. System PreparationYou can download this from the HANA Tools at the link below, https://tools.hana.ondemand.com/#cloud In the unlikely event that you don’t have a JVM on your machine you can get a corresponding one here aswell. You have some choices here, the developer version or the msi. On windows if you install the msi, the difference is that it will create a service and this will be automatically turned on at startup in future, so if this is a test setup you can deactivate this default configuration in the services.msc to free up some of your resources. Once installed you can access the HANA Cloud connector at the https://localhost:8443 (if you didnt change the port during install). You will probably get some security warnings from your browser also as the certificate of this is self-signed, just accept the exception and continue. Once the logon screen appears you can logon with the default user and password (Administrator/manage) and it will guide you to connect to your HANA Cloud Platform Account. If you have problems you can check the help for the HANA Cloud Connector. Now I have my Connector ready and connected to my HCP. The Cloud Connector also in on the same network as my local HANA system so I get started. HANA Cloud Connector ConfigurationFirst lets look at the OData Service url of the HANA system I am exposing. In the Cloud Connector we must now go to the Access Control and create a mapping of the Read url to a virtual one. We can see the host in purple and the Path in Red. The Internal Host and URL Path can be taken from the url and they are marked in Purple and Blue respectively. For the virtual host which is highlighed in Red, you can enter any host and port you want, This will be used later in the HANA Cloud Platform. We are now finished with the local configuration and now we can go to the HANA Clould Platform. HANA Cloud Platform ConfigurationIf we first look in the Cloud Connectors section of our account we can see that our application is exposed and the exposed backend url is the same as the virtual host we gave above. But this is still not enough to use in an application. Our applications need to consume Destinations so we will need to create one. In the same Connectivity Section we have the Destinations option. Again here the exposed url is mark in Red and as we have choosed earlier. You also need to add the 3 additional parameters, Parameters Values WebIDEEnabled true WebIDEUsage odata_xs,odata_gen WebIDESystem “Set this to the destination name” Now you application can be consumed like you would any other destination in the HANA Cloud Platform. We will consume this in the next section.","categories":[{"name":"HCP","slug":"HCP","permalink":"http://briankeenan.xyz/categories/HCP/"}],"tags":[{"name":"HCP, Cloud Connector, OData","slug":"HCP-Cloud-Connector-OData","permalink":"http://briankeenan.xyz/tags/HCP-Cloud-Connector-OData/"}],"keywords":[{"name":"HCP","slug":"HCP","permalink":"http://briankeenan.xyz/categories/HCP/"}]}]}